In [2]:
import pandas as pd
df=pd.read_csv('titanic.csv')
df.head()

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0

In [3]:
df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis='columns',inplace=True)
df.head()
# removing unnecessary data columns

   Pclass     Sex   Age     Fare  Survived
0       3    male  22.0   7.2500         0
1       1  female  38.0  71.2833         1
2       3  female  26.0   7.9250         1
3       1  female  35.0  53.1000         1
4       3    male  35.0   8.0500         0

In [4]:
inputs = df.drop('Survived',axis='columns')#inputs for training
target = df.Survived#output for training data

In [5]:
dummies = pd.get_dummies(inputs.Sex)
# Sex has value male and female in string so we 
# have  to convert it into numerical form
dummies.head(3)
# OR
#inputs.Sex = inputs.Sex.map({'male': 1, 'female': 2})

   female  male
0       0     1
1       1     0
2       1     0

In [6]:
inputs=pd.concat([inputs,dummies],axis='columns')
# adding new columns male and female with input
inputs.head()

   Pclass     Sex   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0
3       1  female  35.0  53.1000       1     0
4       3    male  35.0   8.0500       0     1

In [7]:
inputs.drop(['Sex'],axis='columns',inplace=True)
# removing colun sex as we already have its value
inputs.head()

   Pclass   Age     Fare  female  male
0       3  22.0   7.2500       0     1
1       1  38.0  71.2833       1     0
2       3  26.0   7.9250       1     0
3       1  35.0  53.1000       1     0
4       3  35.0   8.0500       0     1

In [8]:
inputs.columns[inputs.isna().any()]
# checks if any inputs columns have NaN value

Index(['Age'], dtype='object')

In [9]:
inputs.Age[0:10]

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

In [10]:
inputs.Age=inputs.Age.fillna(inputs.Age.mean())
inputs.head(6)

   Pclass        Age     Fare  female  male
0       3  22.000000   7.2500       0     1
1       1  38.000000  71.2833       1     0
2       3  26.000000   7.9250       1     0
3       1  35.000000  53.1000       1     0
4       3  35.000000   8.0500       0     1
5       3  29.699118   8.4583       0     1

In [11]:
from sklearn.model_selection import train_test_split
X_train,X_test,y_train,y_test=train_test_split(inputs,target,test_size=0.2,random_state=32)

In [12]:
len(X_train)

712

In [13]:
len(X_test)

179

In [14]:
len(inputs)

891

In [15]:
X_train

     Pclass        Age      Fare  female  male
293       3  24.000000    8.8500       1     0
617       3  26.000000   16.1000       1     0
424       3  18.000000   20.2125       0     1
888       3  29.699118   23.4500       1     0
230       1  35.000000   83.4750       1     0
..      ...        ...       ...     ...   ...
403       3  28.000000   15.8500       0     1
88        1  23.000000  263.0000       1     0
310       1  24.000000   83.1583       1     0
555       1  62.000000   26.5500       0     1
727       3  29.699118    7.7375       1     0

[712 rows x 5 columns]

In [16]:
from sklearn.naive_bayes import GaussianNB
model=GaussianNB()

# Training

In [17]:
model.fit(X_train,y_train)

GaussianNB(priors=None, var_smoothing=1e-09)

In [18]:
# Accuracy
model.score(X_test,y_test)

0.7877094972067039

In [19]:
X_test[0:10]
# inputs for testing

     Pclass        Age      Fare  female  male
837       3  29.699118    8.0500       0     1
334       1  29.699118  133.6500       1     0
849       1  29.699118   89.1042       1     0
778       3  29.699118    7.7375       0     1
413       2  29.699118    0.0000       0     1
151       1  22.000000   66.6000       1     0
826       3  29.699118   56.4958       0     1
282       3  16.000000    9.5000       0     1
881       3  33.000000    7.8958       0     1
848       2  28.000000   33.0000       0     1

In [20]:
y_test[0:10]
# Outputs for testing

837    0
334    1
849    1
778    0
413    0
151    1
826    0
282    0
881    0
848    0
Name: Survived, dtype: int64

In [21]:
model.predict(X_test[0:10])

array([0, 1, 1, 0, 0, 1, 0, 0, 0, 0], dtype=int64)

In [23]:
model.predict_proba(X_test[0:10])

array([[9.90333859e-01, 9.66614050e-03],
       [1.37780678e-05, 9.99986222e-01],
       [8.12576595e-04, 9.99187423e-01],
       [9.90314342e-01, 9.68565810e-03],
       [9.77015690e-01, 2.29843103e-02],
       [2.79503297e-03, 9.97204967e-01],
       [9.78667879e-01, 2.13321207e-02],
       [9.87951571e-01, 1.20484293e-02],
       [9.90597979e-01, 9.40202111e-03],
       [9.75318331e-01, 2.46816689e-02]])